第１７回 DataFrame(およびSeries)の重要な関数

.unique()                               
.nunique()                                   
.value_counts()                                  
.apply()

必要なときに毎回ググって出会えばいいが　　　　　　　　　　　　　　　　　　　　　　　　　　　　　
★データを解析する上で必ず使う関数ばかり！

In [5]:
import pandas as pd
df = pd.read_csv('train.csv')
df.head()

,PassengerId,Survived,Pclass,Name,Sex,Age,SibSp,Parch,Ticket,Fare,Cabin,Embarked
0,1,0,3,"Braund, Mr. Owen Harris",male,22.0,1,0,A/5 21171,7.2500,NaN,S
1,2,1,1,"Cumings, Mrs. John Bradley (Florence Briggs Th...",female,38.0,1,0,PC 17599,71.2833,C85,C
2,3,1,3,"Heikkinen, Miss. Laina",female,26.0,0,0,STON/O2. 3101282,7.9250,NaN,S
3,4,1,1,"Futrelle, Mrs. Jacques Heath (Lily May Peel)",female,35.0,1,0,113803,53.1000,C123,S
4,5,0,3,"Allen, Mr. William Henry",male,35.0,0,0,373450,8.0500,NaN,S

In [6]:
# .unique(), nunique()
df['Pclass'].unique() # そのSeriesでユニークな値のリストを返す

array([3, 1, 2])

In [7]:
df['Pclass'].nunique() # ユニークな値の数

3

「このカラムはどんな値を保持するんだろう？」, 「本当にPclassは1, 2, 3しか値がないのだろうか？」 と思ったときに使う

In [9]:
# .value_counts() Seriesの関数． それぞれの値に対していくつのレコードがあるのかをSeries形式で返す
df['Pclass'].value_counts()

3    491
1    216
2    184
Name: Pclass, dtype: int64

In [1]:
# ★ .apply() 基本的にDataFrameはこれで処理
# DataFrameの全てのレコードに処理をして，その結果を別のカラムに格納する事ができる

In [2]:
# まずageからage_groupの値を返す関数
def get_age_group(age):
    return str(age)[0] + '0s'
get_age_group(45)

'40s'

In [4]:
import pandas as pd
df = pd.DataFrame({
    'name': ['John', 'Mike', 'Emily'],
    'age' : ['23', '36', '42']
})
df

    name age
0   John  23
1   Mike  36
2  Emily  42

In [6]:
df['age_group'] = df['age'].apply(get_age_group)
df

    name age age_group
0   John  23       20s
1   Mike  36       30s
2  Emily  42       40s

（応用）以下の２つも知っておいたほうが良い　　　　　　　　　　　　　　　　　　　　　　　　　　　
1, lambda関数を使った.apply()の使い方     
2, 特定のカラムではなくレコード全体に対して使う.apply()の使い方

In [7]:
df = pd.DataFrame({
    'name': ['John', 'Mike', 'Emily'],
    'age' : ['23', '36', '42']
})
df

    name age
0   John  23
1   Mike  36
2  Emily  42

In [10]:
# lambda関数を使った.apply()の使い方
df['age_group'] = df['age'].apply(lambda x: str(x)[0] + '0s')
df

    name age age_group
0   John  23       20s
1   Mike  36       30s
2  Emily  42       40s

In [13]:
# レコードに対して使う ex) レコードのnameとageの値を使って’description’というカラムに新たな値を入れたいとき
df = pd.DataFrame({
    'name': ['John', 'Mike', 'Emily'],
    'age' : ['23', '36', '42']
})
df['description'] = df.apply(lambda row: '{} is {} years old'.format(row['name'], row['age']), axis=1)

In [14]:
df

    name age            description
0   John  23   John is 23 years old
1   Mike  36   Mike is 36 years old
2  Emily  42  Emily is 42 years old

行に対しての場合、axis=1 を必ず指定！　(⇔ axis=0はカラム)